/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   27.c                                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kkohta <kkohta@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/05 15:31:57 by kkohta            #+#    #+#             */
/*   Updated: 2022/12/05 15:34:48 by kkohta           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

typedef char String[1024];

int	main(void)
{
	String monsterName = "ドラゴン";
	printf("敵は%s\n", monsterName);
	return (0);
}
