/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   93.c                                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kkohta <kkohta@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/10 22:52:45 by kkohta            #+#    #+#             */
/*   Updated: 2022/12/10 23:05:57 by kkohta           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	main(void)
{
	int a = 70;
	printf("変数aには70が入っています。\n");

	int* addrA = (void*)&a;
	printf("変数aのアドレス :%p\n", addrA);
	printf("%p番地に格納されている情報 :%d\n", addrA, *addrA);


	return (0);
}
