/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   2_1.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kkohta <kkohta@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/11 15:12:02 by kkohta            #+#    #+#             */
/*   Updated: 2022/12/11 15:15:59 by kkohta           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	main(void)
{
	int n;

	puts("整数を入力せよ : ");
	scanf("%d", &n);

	printf("7を加えると%dです。\n", n + 7);
	printf("7を減じると%dです。\n", n - 7);
	printf("7を乗じると%dです。\n", n * 7);
	printf("7を除すると%dです。\n", n / 7);
	printf("7を除した余は%dです。\n", n % 7);

	return (0);
}
