/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   2_3.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kkohta <kkohta@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/12 20:01:12 by kkohta            #+#    #+#             */
/*   Updated: 2022/12/12 20:03:44 by kkohta           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	main(void)
{
	int x, y;

	printf("二つの整数を入力せよ。\n");
	printf("整数x : ");	scanf("%d", &x);
	printf("整数y : ");	scanf("%d", &y);

	printf("xの値はyの%d％です。\n", 100 * x / y);

	return (0);
}
