/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   2_5.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kkohta <kkohta@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/12 20:12:30 by kkohta            #+#    #+#             */
/*   Updated: 2022/12/12 20:15:34 by kkohta           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	main(void)
{
	int x, y;

	printf("二つの整数を入力せよ。\n");
	printf("整数x : ");	scanf("%d", &x);
	printf("整数y : ");	scanf("%d", &y);

	int ave = (x + y) / 2;

	printf("平均値%dの符号を反転した値は%dです。\n", ave, -ave);

	return (0);
}
