/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   7_5.c                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kohtakochi <marvin@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/01 21:56:57 by kohtakochi        #+#    #+#             */
/*   Updated: 2022/12/01 21:58:53 by kohtakochi       ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	main(void)
{
	int score;
	printf("点数を入力してください:");
	scanf("%d", &score);
	if (score > 100) score = 100;
	printf("点数は %d点です。\n", score);
	return (0);
}
