/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   sigma.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kohtakochi <marvin@42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/01 21:32:10 by kohtakochi        #+#    #+#             */
/*   Updated: 2022/12/01 21:38:51 by kohtakochi       ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	main(void)
{
	int min, max, sum;
	printf("最小値と最大値をカンマで区切って入力しなさい。:");
	scanf("%d,%d", &min, &max);
	sum = (min + max) * (max - min + 1) / 2;
	printf("%d~%dまでの合計は%dです!\n", min, max, sum);
	return (0);
}
