/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   1_11.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kkohta <kkohta@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/11 15:03:10 by kkohta            #+#    #+#             */
/*   Updated: 2022/12/11 15:05:49 by kkohta           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	main(void)
{
	int n1, n2;

	puts("二つの整数を有力してください。");
	printf("整数1 : ");	scanf("%d", &n1);
	printf("整数1 : ");	scanf("%d", &n2);

	int seki;
	seki = n1 * n2;

	printf("それらの積は%dです。\n", seki);

	return (0);
}
