/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   11.c                                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kkohta <kkohta@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/04 07:23:16 by kkohta            #+#    #+#             */
/*   Updated: 2022/12/04 07:26:07 by kkohta           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	main(void)
{
	printf("パズルRPG:スッキリ竜魔王討伐\n");
	printf("Ver.0.1 by 光太\n");
	printf("<ただいま学習・製作中!!>\n");
	printf("プログラムを終了します\n");
	return (0);
}
