/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   41.c                                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kkohta <kkohta@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/12/07 17:39:01 by kkohta            #+#    #+#             */
/*   Updated: 2022/12/07 17:41:23 by kkohta           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
#include <stdbool.h>

int	main(void)
{
	bool tenki = true;
	if (tenki == true)
	{
		printf("洗濯をします。\n");
		printf("散歩をしに行きます。\n");
	} else {
		printf("映画を見に行きます。\n");
	}
	return (0);
}
