/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   sample.cpp                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kkohta <kkohta@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/20 16:31:04 by kkohta            #+#    #+#             */
/*   Updated: 2023/01/20 16:41:17 by kkohta           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <iostream>
using namespace std;

int	main() {
	string S;
	cin >> S;

	// ここからプログラム記述
	int x = 1;
	for (int i = 0; i < S.size(); i ++) {
		if (S.at(i) == '1') {
			i ++;
		} else {
			if (S.at(i) == '+') {
				x += 1;
				i ++;
			} else {
				x-= 1;
				i ++;
			}
		}
	}

	cout << x << endl;
}
